## Pandas 학습

### 라이브러리 추가
```python
!pip install pandas
```

- Successfully Installed... : 최초설치
- Requiremnet already satisfied...: 이미 설치 됨

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\dev\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\dev\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dev\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\dev\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\dev\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 판다스 라이브러리 로딩
```python
import pandas as pd```

In [3]:
import pandas as pd

### 판다스 기본
#### DaraFrame 객체
- 파이썬 2차원 리스트(배열)와 동일
- 행(row) 각 하나의 유니크 데이터 묶음
- 열(column) 유니크 데이터 각각의 특성

In [4]:
## 딕셔너리로 DataFrame 객체 생성 = 2차원 리스트와 동일하게 생성 가능
data = {'이름': ['성명건', '홍길동', '애슐리'], '나이': [47, 20, 40], '결혼': [True, False, True]}
df = pd.DataFrame(data=data)
df

    이름  나이     결혼
0  성명건  47   True
1  홍길동  20  False
2  애슐리  40   True

In [5]:
data = [['성명건', 47, '부산', 'smg@naver.com', 'True'], ['홍길동', 20, '서울', 'hgd@gmail.com', False], 
        ['애슐리', 40, '경기', 'ashley@nate.com', True], ['홍길순', 18, '서울', 'hgs@daum.net', False]]

data

[['성명건', 47, '부산', 'smg@naver.com', 'True'],
 ['홍길동', 20, '서울', 'hgd@gmail.com', False],
 ['애슐리', 40, '경기', 'ashley@nate.com', True],
 ['홍길순', 18, '서울', 'hgs@daum.net', False]]

In [6]:
## 2차원 리스트로 DataFrame 객체 생성
df = pd.DataFrame(data=data, columns=['이름', '나이', '주소', '이메일', '결혼'])
df

    이름  나이  주소              이메일     결혼
0  성명건  47  부산    smg@naver.com   True
1  홍길동  20  서울    hgd@gmail.com  False
2  애슐리  40  경기  ashley@nate.com   True
3  홍길순  18  서울     hgs@daum.net  False

In [7]:
## DataFrame에서 데이터 조회(열) - 리스트는 for문을 써야 출력가능
df['이름']

0    성명건
1    홍길동
2    애슐리
3    홍길순
Name: 이름, dtype: object

In [8]:
## 데이터프레임 조회(2개 열)
df[['이름', '나이']]

    이름  나이
0  성명건  47
1  홍길동  20
2  애슐리  40
3  홍길순  18

In [9]:
## 데이터프레임 행으로 조회
df.loc[0]

이름               성명건
나이                47
주소                부산
이메일    smg@naver.com
결혼              True
Name: 0, dtype: object

In [10]:
## 데이터프레임 행으로 조회
df.loc[[1, 3]]

    이름  나이  주소            이메일     결혼
1  홍길동  20  서울  hgd@gmail.com  False
3  홍길순  18  서울   hgs@daum.net  False

In [11]:
# 현재 데이터프레임 확인
df

    이름  나이  주소              이메일     결혼
0  성명건  47  부산    smg@naver.com   True
1  홍길동  20  서울    hgd@gmail.com  False
2  애슐리  40  경기  ashley@nate.com   True
3  홍길순  18  서울     hgs@daum.net  False

In [12]:
## 새 컬럼 추가
df['전화번호'] = ['010', '011', '017', '019']

In [13]:
# 추가된 데이터프레임 확인
df

    이름  나이  주소              이메일     결혼 전화번호
0  성명건  47  부산    smg@naver.com   True  010
1  홍길동  20  서울    hgd@gmail.com  False  011
2  애슐리  40  경기  ashley@nate.com   True  017
3  홍길순  18  서울     hgs@daum.net  False  019

In [14]:
## 열 삭제
df.drop('결혼', axis=1) # axis = 0(행), 1(열)   # 열을 지울 때는 axis=1만 사용

    이름  나이  주소              이메일 전화번호
0  성명건  47  부산    smg@naver.com  010
1  홍길동  20  서울    hgd@gmail.com  011
2  애슐리  40  경기  ashley@nate.com  017
3  홍길순  18  서울     hgs@daum.net  019

In [15]:
## drop()은 삭제한 내용을 출력만 해줌(완전삭제X, 일시삭제O). 완전히 삭제하려면 inplace 옵션 사용(한번 지우면 끝)
# inplace는 화면에 출력 안됨
df.drop('결혼', axis=1, inplace=True)

In [16]:
# 삭제를 확인
df

    이름  나이  주소              이메일 전화번호
0  성명건  47  부산    smg@naver.com  010
1  홍길동  20  서울    hgd@gmail.com  011
2  애슐리  40  경기  ashley@nate.com  017
3  홍길순  18  서울     hgs@daum.net  019

In [17]:
## 행추가
df.loc[4] = ['손흥민', 32, '런던', 'shm@gamil.com', '020']

In [18]:
df

    이름  나이  주소              이메일 전화번호
0  성명건  47  부산    smg@naver.com  010
1  홍길동  20  서울    hgd@gmail.com  011
2  애슐리  40  경기  ashley@nate.com  017
3  홍길순  18  서울     hgs@daum.net  019
4  손흥민  32  런던    shm@gamil.com  020

In [19]:
## 행 삭제(완전히 삭제하려면 inplace를 사용하거나 변수에 재할당)
df2 = df.drop(3)

In [20]:
df2

    이름  나이  주소              이메일 전화번호
0  성명건  47  부산    smg@naver.com  010
1  홍길동  20  서울    hgd@gmail.com  011
2  애슐리  40  경기  ashley@nate.com  017
4  손흥민  32  런던    shm@gamil.com  020

In [21]:
## 행삭제 inplace
df.drop(2, axis=0, inplace=True)    # 행을 지울 때는 axis=0만 사용 또는 생략

In [22]:
df

    이름  나이  주소            이메일 전화번호
0  성명건  47  부산  smg@naver.com  010
1  홍길동  20  서울  hgd@gmail.com  011
3  홍길순  18  서울   hgs@daum.net  019
4  손흥민  32  런던  shm@gamil.com  020

In [23]:
## 열 이름 변경
df.rename(columns={'전화번호':'휴대폰'}, inplace=True)

In [24]:
df

    이름  나이  주소            이메일  휴대폰
0  성명건  47  부산  smg@naver.com  010
1  홍길동  20  서울  hgd@gmail.com  011
3  홍길순  18  서울   hgs@daum.net  019
4  손흥민  32  런던  shm@gamil.com  020

- 데이터 프레임은 파이썬의 2차원 리스트와 동일하지만, 좀더 사용하기 쉽도록 만든 클래스

#### 시리즈 객체

- 파이썬에서 1차원 리스트(배열)
- 시리즈들 그루핑한게 데이터 프레임
- 가장 최소단위

In [26]:
data = [47, 20, 40, 18, 32]
srs = pd.Series(data=data)
srs

0    47
1    20
2    40
3    18
4    32
dtype: int64

In [29]:
## 데이터프레임의 한 열을 가지고온 자료구조와 시리즈는 동일
type(df['나이'])

pandas.core.series.Series

In [31]:
type(srs)

pandas.core.series.Series

In [33]:
srs = pd.Series(data=data, index=['성명건', '홍길동', '애슐리', '홍길순', '손흥민'])
srs

성명건    47
홍길동    20
애슐리    40
홍길순    18
손흥민    32
dtype: int64

In [35]:
## 조회
srs['손흥민']

32

In [37]:
## 값 변경
srs['성명건'] = 48

In [39]:
srs

성명건    48
홍길동    20
애슐리    40
홍길순    18
손흥민    32
dtype: int64

In [41]:
## 데이터프레임에서 한 행을 가져와도 시리즈.
df.loc[1]

이름               홍길동
나이                20
주소                서울
이메일    hgd@gmail.com
휴대폰              011
Name: 1, dtype: object

#### 데이터프레임 사용하기
-